from enum import Enum, unique

"""
    返回码枚举类
"""

@unique
class ResultEnum(Enum):
    # 通用返回码
    SUCCESS = ("0000", "成功")
    FAIL = ("9999", "失败")
    # / ** ** ** ** ** ** *数据
    # E134 ** ** start ** ** ** ** ** ** ** ** /
    E1340001 = ("E1340001", "缺少必传参数usedRatio")
    # / ** ** ** ** ** ** *数据
    # E134 ** ** end ** ** ** ** ** ** ** ** /

    # / ** ** ** ** ** ** *通用模块
    # E000 ** ** start ** ** ** ** ** ** ** ** /
    E0000001 = ("E0000001", "params参数缺失")
    E0000002 = ("E0000002", "token信息已失效或非法")
    E0000003 = ("E0000003", "账户可用余额不足")
    E0000004 = ("E0000004", "项目不存在")
    E0000005 = ("E0000005", "用户不存在")
    E0000006 = ("E0000006", "用户未开通资管账户")
    E0000007 = ("E0000007", "请求正在处理中请稍后再试!")
    E0000008 = ("E0000008", "项目编号不能为空")
    E0000009 = ("E0000009", "您没有访问该接口的权限!")
    E0000010 = ("E0000010", "用户上行存管账户未绑卡或者e子账户未开通")
    E0000011 = ("E0000011", "该用户非存量用户")
    E0000012 = ("E0000012", "资管账号不能为空")
    E0000013 = ("E0000013", "存量用户未设置密码")
    E0000014 = ("E0000014", "存量用户未绑卡")
    E0000015 = ("E0000015", "api验证admin token不通过")
    E0000016 = ("E0000016", "标的状态非法")
    E0000017 = ("E0000017", "请求无返回异常")
    E0000018 = ("E0000018", "操作失败!")
    E0000019 = ("E0000019", "开户次数已超过当天限制请明天再试!")
    E0000020 = ("E0000020", "账号状态异常！")
    E0000021 = ("E0000021", "上海银行系统升级，请稍后")
    E0000022 = ("E0000022", "验证码不能为空!")
    E0000023 = ("E0000023", "验证码错误!")
    E0000024 = ("E0000024", "邮箱格式错误!")
    E0000025 = ("E0000025", "文件没有生成!")
    E0000026 = ("E0000026", "不能为空")
    E0000027 = ("E0000027", "获取企业首页数据失败刷新重试")
    E0000028 = ("E0000028", "参数%s格式不正确")
    E0000029 = ("E0000029", "订阅异常请联系客服")
    E0000030 = ("E0000030", "传入参数错误")
    E0000031 = ("E0000031", "上传文件格式不符")
    E0000032 = ("E0000032", "上传文件大小不符")
    E0000033 = ("E0000033", "公告id不能为空")
    E0000034 = ("E0000034", "获取公告详细信息异常")
    E0000035 = ("E0000035", "未找到该企业的信息")
    E0000036 = ("E0000036", "api接口调用失败")
    E0000037 = ("E0000037", "请在工作时间 8：00-19：00 再试！")
    E0000038 = ("E0000038", "文件读取失败")
    E0000039 = ("E0000039", "操作文件不能为空!")
    E0000040 = ("E0000040", "金额应该大于0")
    E0000041 = ("E0000041", "%s不存在")
    E0000042 = ("E0000042", "%s没有权限访问")
    E0000043 = ("E0000043", "请勿重复添加")
    E0000044 = ("E0000044", "记录不存在")
    E0000045 = ("E0000045", "上传失败")
    E0000046 = ("E0000046", "请求过于频繁，请稍后重试")
    E0000047 = ("E0000047", "%s已经存在")
    E0000048 = ("E0000048", "状态不正确")
    E0000049 = ("E0000049", "上传文件%s")
    E0000050 = ("E0000050", "流水号不能为空!")
    E0000051 = ("E0000051", "两次密码不一致.")
    E0000052 = ("E0000052", "导入模板校验异常.")
    E0000053 = ("E0000053", "导入模板校验失败.")

    # / ** ** ** ** ** ** *通用模块
    # E000 ** ** end ** ** ** ** ** ** ** ** /
if __name__ == "__main__":
    print(ResultEnum.E0000050.value[0])
